app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    keyword = params[:search]
    keyword = '*' if keyword==nil || keyword==''
    @articles = Article.search keyword,fields: [:headline,:textonly],page: params[:page], per_page: 10

SELECT  "articles".* FROM "articles" WHERE (portal_source_id=1) ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" WHERE (portal_source_id=1)
---
  def kloop
    @articles=Article.where("portal_source_id=?", 1).paginate(:page => params[:page], :per_page => 10)

SELECT  "articles".* FROM "articles" WHERE (portal_source_id=2) ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 150]]
SELECT COUNT(*) FROM "articles" WHERE (portal_source_id=2)
---
  def vb
    @articles=Article.where("portal_source_id=?", 2).paginate(:page => params[:page], :per_page => 10)

SELECT  "articles".* FROM "articles" WHERE (portal_source_id=3) ORDER BY "articles"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
---
  def knews
    @articles=Article.where("portal_source_id=?", 3).paginate(:page => params[:page], :per_page => 10)

INSERT INTO "articles" ("headline", "textonly", "date_published", "textorig", "portal_source_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save