app/controllers/portal_sources_controller.rb

SELECT "portal_sources".* FROM "portal_sources"
---
  def index
    @portal_sources = PortalSource.all

INSERT INTO "portal_sources" ("name", "size", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "kloop"], ["size", 25], ["created_at", "2017-06-10 16:08:01.988909"], ["updated_at", "2017-06-10 16:08:01.988909"]]
---
  def create
    @portal_source = PortalSource.new(portal_source_params)

    respond_to do |format|
      if @portal_source.save

UPDATE "portal_sources" SET "name" = ?, "updated_at" = ? WHERE "portal_sources"."id" = ?  [["name", ".kg"], ["updated_at", "2017-06-10 16:08:33.329372"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @portal_source.update(portal_source_params)

SELECT  "portal_sources".* FROM "portal_sources" WHERE "portal_sources"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_portal_source
      @portal_source = PortalSource.find(params[:id])